---
kind: property
id: P:Autodesk.Revit.DB.Blend.TopProfile
source: html/5051a4cd-4238-d57d-5efc-912aa04cb8d5.htm
---
# Autodesk.Revit.DB.Blend.TopProfile Property

The curves which make up the top profile of the sketch.

## Syntax (C#)
```csharp
public CurveArrArray TopProfile { get; }
```

## Remarks
The indices of the curves in this array match the indices used in the vertex connection map.